Revit 2027 API
MEPAnalyticalModelData.GetNumberOfNodes Method
 Returns the number of analytical nodes.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int GetNumberOfNodes()
Public Function GetNumberOfNodes As Integer
public:
int GetNumberOfNodes()
member GetNumberOfNodes : unit -> int
Return Value
Int32
See Also
Reference
MEPAnalyticalModelData Class
Autodesk.Revit.DB.Analysis Namespace